### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_api_management_api.wallet_support_legacy will be created
  + resource "azurerm_api_management_api" "wallet_support_legacy" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "REST APIs consumed by Customer Service Support. This API group will be removed when app will switch the endpoints"
      + display_name          = "IT-Wallet Customer Support"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "wallet-support-api-legacy"
      + path                  = "api/v1/wallet/support"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-wallet/refs/heads/master/apps/io-wallet-support-func/openapi.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # azurerm_api_management_api.wallet_user_legacy will be created
  + resource "azurerm_api_management_api" "wallet_user_legacy" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "REST APIs consumed by IO App. This API group will be removed when app will switch the endpoints"
      + display_name          = "IT-Wallet User"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "wallet-user-api-legacy"
      + path                  = "api/v1/wallet"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-wallet/refs/heads/master/apps/io-wallet-user-func/openapi.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # azurerm_api_management_api.wallet_user_uat will be created
  + resource "azurerm_api_management_api" "wallet_user_uat" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "REST APIs consumed by IO App"
      + display_name          = "IT-Wallet User (UAT)"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "wallet-user-api-uat"
      + path                  = "api/wallet/uat"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = "uat"
      + version_set_id        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apiVersionSets/wallet-user-apis"

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-wallet/refs/heads/master/apps/io-wallet-user-func/openapi.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # azurerm_api_management_api.wallet_user_uat_legacy will be created
  + resource "azurerm_api_management_api" "wallet_user_uat_legacy" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "REST APIs (UAT) consumed by IO App. This API group will be removed when app will switch the endpoints"
      + display_name          = "IT-Wallet User (UAT)"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "wallet-user-uat-api-legacy"
      + path                  = "api/v1/wallet/uat"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-wallet/refs/heads/master/apps/io-wallet-user-func/openapi.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # azurerm_api_management_api_policy.wallet_support_legacy will be created
  + resource "azurerm_api_management_api_policy" "wallet_support_legacy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "wallet-support-api-legacy"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                  <base />
                  <set-backend-service backend-id="psn-backend-01" />
              </inbound>
            </policies>
        EOT
    }

  # azurerm_api_management_api_policy.wallet_user_legacy will be created
  + resource "azurerm_api_management_api_policy" "wallet_user_legacy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "wallet-user-api-legacy"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                  <include-fragment fragment-id="io-wallet-app-session-fragment" />
                  <base />
                  <set-backend-service backend-id="psn-backend-01" />
              </inbound>
            </policies>
        EOT
    }

  # azurerm_api_management_api_tag.wallet_support_legacy will be created
  + resource "azurerm_api_management_api_tag" "wallet_support_legacy" {
      + api_id = (known after apply)
      + id     = (known after apply)
      + name   = "it-wallet"
    }

  # azurerm_api_management_api_tag.wallet_user_legacy will be created
  + resource "azurerm_api_management_api_tag" "wallet_user_legacy" {
      + api_id = (known after apply)
      + id     = (known after apply)
      + name   = "it-wallet"
    }

  # azurerm_api_management_api_tag.wallet_user_uat_legacy will be created
  + resource "azurerm_api_management_api_tag" "wallet_user_uat_legacy" {
      + api_id = (known after apply)
      + id     = (known after apply)
      + name   = "it-wallet"
    }

  # azurerm_api_management_backend.psn will be updated in-place
  ~ resource "azurerm_api_management_backend" "psn" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/backends/psn-backend-01"
        name                = "psn-backend-01"
      ~ url                 = "http://psn.internal.io.pagopa.it/" -> "https://api.internal.wallet.io.pagopa.it/"
        # (6 unchanged attributes hidden)
    }

  # azurerm_api_management_product_api.wallet_support_legacy will be created
  + resource "azurerm_api_management_product_api" "wallet_support_legacy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "wallet-support-api-legacy"
      + id                  = (known after apply)
      + product_id          = "it-wallet"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # azurerm_api_management_product_api.wallet_user_legacy will be created
  + resource "azurerm_api_management_product_api" "wallet_user_legacy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "wallet-user-api-legacy"
      + id                  = (known after apply)
      + product_id          = "it-wallet"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # azurerm_api_management_product_api.wallet_user_uat_legacy will be created
  + resource "azurerm_api_management_product_api" "wallet_user_uat_legacy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "wallet-user-uat-api-legacy"
      + id                  = (known after apply)
      + product_id          = "it-wallet"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

Plan: 12 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.storage_accounts.azurerm_storage_queue.wallet-instance-creation-email-queue-01,
  on ../_modules/storage_accounts/storage_queue.tf line 3, in resource "azurerm_storage_queue" "wallet-instance-creation-email-queue-01":
   3:   storage_account_name = azurerm_storage_account.common.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 3 more similar warnings elsewhere)
```

</details>
